system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format	ascii;
    class	dictionary;
    location	polyMesh;
    object	blockMeshDict;
}

scale 0.001;
vertices
(
  (0.0 0.0 0.0)
  (24.1 0.0 0.0)
  (27.1 0.0 0.0)
  (27.5 0.0 0.0)
  (42.5 0.0 0.0)
  (42.9 0.0 0.0)
  (45.9 0.0 0.0)
  (160.0 0.0 0.0)
  
  (160.0 0.5 0.0)
  (45.9 0.5 0.0)
  (42.9 0.5 0.0)
  (42.5 0.5 0.0)
  (27.5 0.5 0.0)
  (27.1 0.5 0.0)
  (24.1 0.5 0.0)
  (0.0 0.5 0.0)
  
  (0.0 0.0 0.01)
  (24.1 0.0 0.01)
  (27.1 0.0 0.01)
  (27.5 0.0 0.01)
  (42.5 0.0 0.01)
  (42.9 0.0 0.01)
  (45.9 0.0 0.01)
  (160.0 0.0 0.01)
  
  (160.0 0.5 0.01)
  (45.9 0.5 0.01)
  (42.9 0.5 0.01)
  (42.5 0.5 0.01)
  (27.5 0.5 0.01)
  (27.1 0.5 0.01)
  (24.1 0.5 0.01)
  (0.0 0.5 0.01)
  
);

blocks
(

hex     (0 1 14 15 16 17 30 31) (10 40 1)
	simpleGrading  (1
		       ((0.5 0.5 0.2) (0.5 0.5 5))
		       1)

hex      (1 2 13 14 17 18 29 30) (18 40 1)
	simpleGrading  (
		       ((0.2 0.3 3) (0.6 0.4 1) (0.2 0.3 0.33))
		       ((0.5 0.5 0.2) (0.5 0.5 5))
		       1)

hex      (2 3 12 13 18 19 28 29) (4 40 1)
	simpleGrading  (1
		       ((0.5 0.5 0.2) (0.5 0.5 5))
		       1)

hex      (3 4 11 12 19 20 27 28) (80 40 1)
 	simpleGrading  (
		       ((0.2 0.3 6) (0.6 0.4 1) (0.2 0.3 0.17))
		       ((0.5 0.5 0.2) (0.5 0.5 5))
		       1)

hex      (4 5 10 11 20 21 26 27) (4 40 1)
	simpleGrading  (1
		       ((0.5 0.5 0.2) (0.5 0.5 5))
		       1)

hex      (5 6 9 10 21 22 25 26) (18 40 1)
	simpleGrading  (
		       ((0.2 0.3 6) (0.6 0.4 1) (0.2 0.3 0.17))
		       ((0.5 0.5 0.2) (0.5 0.5 5))
		       1)

hex      (6 7 8 9 22 23 24 25) (70 40 1)
	simpleGrading  (1
		       ((0.5 0.5 0.2) (0.5 0.5 5))
		       1)

);

edges
(
);


boundary
(
    end   // a changer
    {
        type patch;
        faces
        (
            (0 16 31 15)
        );
    }
    source
    {
        type wall;
        faces
        (
            (7 23 24 8)
        );
    }
    periodicB
    {
        type cyclic;
	neighbourPatch periodicT;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
            (3 19 20 4)
            (4 20 21 5)
            (5 21 22 6)
            (6 22 23 7)
        );
    }
    periodicT
    {
        type cyclic;
	neighbourPatch periodicB;
        faces
        (
            (15 31 30 14)
            (14 30 29 13)
            (13 29 28 12)
            (12 28 27 11)
            (11 27 26 10)
            (10 26 25 9)
            (9 25 24 8)
        );
    }
    frontend
    {
        type empty;
        faces
        (
            (16 17 30 31)
            (17 18 29 30)
            (18 19 28 29)
            (19 20 27 28)
            (20 21 26 27)
            (21 22 25 26)
            (22 23 24 25)
        );
    }
    backend
    {
        type empty;
        faces
        (
            (0 1 14 15)
            (1 2 13 14)
            (2 3 12 13)
            (3 4 11 12)
            (4 5 10 11)
            (5 6 9 10)
            (6 7 8 9)
        );
    }
);


mergePatchPairs
(
);

